# -*- coding: utf-8 -*-
alpha = {'Ы', 'З', 'Р', 'Н', 'ч', 'Й', 'я', 'Ю', 'д', 'К', 'в', 'ь', 'У', 'и', 'з', 'Е', 'П', 'к', 'щ', 'ш', 'ы', 'ю', 'ц', 'э', 'Х', 'А', 'г', 'М', 'о', 'Ш', 'Ъ', 'у', 'м', 'Ж', 'Щ', 'ж', 'л', 'н', 'Ь', 'е', 'р', 'ф', 'Ч', 'Ф', 'И', 'Ц', 'Э', 'п', 'О', 'а', 'х', 'Я', 'Т', 'й', 'т', 'Л', 'С', 'б', 'Г', 'с', 'ъ', 'Б', 'Д', 'В', "Ё", "ё"}

lower = {'ч', 'я', 'д', 'в', 'ь', 'и', 'з', 'к', 'щ', 'ш', 'ы', 'ю', 'ц', 'э', 'г', 'о', 'у', 'м', 'ж', 'л', 'н', 'е', 'р', 'ф', 'п', 'а', 'х', 'й', 'т', 'б', 'с', 'ъ', "ё"} #lower register letters

vowels = set("уеыаоэяию") # russian vowels
spec = set("ьъ") # russian special letters, that you can`t sound

types = {"существительное", "прилагательное", "глагол", "местоимение", "причастие", "деепричастие", "союз", "предлог", "наречие", "междометие"}

terms = {"существительное": "сущ.", "прилагательное": "прил.", "местоимение": "мест.", "глагол": "гл." , "причастие": "прич.", "деепричастие": "деепр.", "союз": "союз", "наречие": "нар.", "междометие": "межд.", "средний род": "ср. р.", "мужской род": "м. р.", "женский род": "ж. р.", "множественное число":  "мн. ч.", "единственное число": "ед. ч.", "настоящее время": "н. вр.", "прошедшее время": "пр. вр.", "будущее время": "б. вр.", "повелительное наклонение": "повелит.", "действительное причастие": "действ. дееприч.", "страдательное причастие": "страд. дееприч.",  "совершенный вид": "с. в.", "несовершенный вид": "нес. в.", "переходный": "перех.", "одушевлённое": "одуш.", "неодушевлённое": "неодуш.", "нарицательное": "нариц.", "собственное": "собств.", "предикатив": "предикат.", "определительное": "определит.", "качественное": "качеств.", "собственное": "собств.", "нарицательное": "нариц."}

antiterms = dict()
for el in terms:
    antiterms[terms[el]] = el